{"basics":{"name":"Zhicheng Guo","label":"Ph.D. Candidate in Electrical and Computer Engineering","image":"","email":"zhicheng.guo@duke.edu","phone":"347-720-8974","url":"https://scholar.google.com/citations?user=3J683FMAAAAJ&hl=en","summary":"Ph.D. candidate at Duke University with expertise in machine learning, medical informatics, and interpretable AI, focusing on improving healthcare outcomes through innovative computational methods.","location":{"address":"","postalCode":"","city":"Durham","countryCode":"US","region":"North Carolina"},"profiles":[{"network":"Google Scholar","username":"ZhichengGuo","url":"https://scholar.google.com/citations?user=3J683FMAAAAJ&hl=en"}]},"work":[{"name":"Duke University Health System","position":"Quantitative Research Intern","url":"","startDate":"2021-05-01","endDate":"2021-08-01","summary":"Investigated correlations between cellular populations and cognitive scores, developed machine learning models to predict drug use and impairment, and analyzed flow cytometry data.","highlights":["Analyzed patient PBMC and CSF flow cytometry data.","Developed predictive models for drug effects using machine learning."]}],"volunteer":[],"education":[{"institution":"Duke University","location":"Durham, NC","url":"","area":"Electrical and Computer Engineering","studyType":"Ph.D.","startDate":"2022-01-01","endDate":"Present","score":"","courses":[]},{"institution":"Duke University","location":"Durham, NC","url":"","area":"Computer Science","studyType":"M.S.","startDate":"2020-08-01","endDate":"2021-12-01","score":"","courses":[]},{"institution":"Rensselaer Polytechnic Institute","location":"Troy, NY","url":"","area":"Computer Science","studyType":"B.Sc.","startDate":"2016-07-01","endDate":"2020-05-01","score":"","courses":[]}],"awards":[],"certificates":[],"publications":[{"name":"Improving Clinician Performance in Classification of EEG Patterns on the Ictal-Interictal-Injury Continuum using Interpretable Machine Learning","publisher":"New England Journal of Medicine AI (NEJM AI)","releaseDate":"2024","url":"","summary":""},{"name":"SiamQuality: a ConvNet-based Foundation Model for Photoplethysmography Signals","publisher":"Physiological Measurement","releaseDate":"2024","url":"","summary":""},{"name":"Integrated Single-cell Multiomic Analysis of HIV Latency Reversal Reveals Novel Regulators of Viral Reactivation","publisher":"Genomics, Proteomics & Bioinformatics","releaseDate":"2024","url":"","summary":""},{"name":"Sparse learned kernels for interpretable and efficient medical time series processing","publisher":"Nature Machine Intelligence","releaseDate":"2024","url":"https://www.nature.com/articles/s42256-024-00898-4","summary":"Rapid, reliable and accurate interpretation of medical time series signals is crucial for high-stakes clinical decision-making. Deep learning methods offered unprecedented performance in medical signal processing but at a cost: they were compute intensive and lacked interpretability. We propose sparse mixture of learned kernels (SMoLK), an interpretable architecture for medical time series processing. SMoLK learns a set of lightweight flexible kernels that form a single-layer sparse neural network, providing not only interpretability but also efficiency, robustness and generalization to unseen data distributions. We introduce parameter reduction techniques to reduce the size of SMoLK networks and maintain performance. We test SMoLK on two important tasks common to many consumer wearables: photoplethysmography artefact detection and atrial fibrillation detection from single-lead electrocardiograms. We find that SMoLK matches the performance of models orders of magnitude larger. It is particularly suited for real-time applications using low-power devices, and its interpretability benefits high-stakes situations."}],"skills":[{"name":"Programming","level":"","icon":"","keywords":["Python","C/C++","Java","HTML","CSS"]},{"name":"Machine Learning Frameworks","level":"","icon":"","keywords":["PyTorch","Hugging Face","TensorFlow"]},{"name":"Data Tools","level":"","icon":"","keywords":["NumPy","Matplotlib","Pandas","Slurm","SQLite"]}],"languages":[],"interests":[],"references":[],"projects":[]}